src/Documents/ДанныеДокументаМЭДО/ДанныеДокументаМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДанныеДокументаМЭДО</name>
  <comment>Контейнер загруженного/отправленного по МЭДО документа. И дополнительная детализация для МЭДО</comment>
  <registerRecords>InformationRegister.СостоянияДокументовМЭДО</registerRecords>
  <attributes>
    <name>АрхивЭСД</name>
    <comment>Внутри ДвоичныеДанные</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияМЭДО</name>
    <type>
      <types>EnumRef.ВерсииФорматаМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйФайл</name>
    <comment>Главный документ из сообщения, остальные - приложения к нему</comment>
    <type>
      <types>DefinedType.ПрисоединенныйФайлМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ГотовКОтправке</name>
    <comment>Для исходящего</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрифДоступа</name>
    <type>
      <types>DefinedType.ГрифДоступаМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DefinedType.ПредметМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДокумента</name>
    <comment>Для входящего - из паспорта сообщения, для исходящего - GUID из ссылки на документ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяАрхиваЭСД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоСоставления</name>
    <type>
      <types>CatalogRef.МестаСоставленияДокументовМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.НаправленияСообщенийМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ОтветственныйМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлен</name>
    <comment>Для исходящего</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущееСостояние</name>
    <comment>Для отбора в списке</comment>
    <type>
      <types>EnumRef.СостоянияДокументовМЭДО</types>
    </type>
  </attributes>
</mdclass:Document>

src/Enums/НаправленияСообщенийМЭДО/НаправленияСообщенийМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НаправленияСообщенийМЭДО</name>
  <enumValues>
    <name>Входящее</name>
  </enumValues>
  <enumValues>
    <name>Исходящее</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ДанныеДокументаМЭДО/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПриСозданииНаСервереРедакцииКонфигурации();
	
	// Открытие из формы:
	Если Объект.Ссылка.Пустая()
		И (Параметры.Свойство("ОткрытиеИзФормы") И Параметры.ОткрытиеИзФормы = Истина) Тогда
		
		Объект.Документ = Параметры.Документ;
		Если ИнтеграцияСМЭДО.ЭтоИсходящийДокумент(Объект.Документ) Тогда
			Объект.ИдентификаторДокумента = "" + Объект.Документ.УникальныйИдентификатор();
			Объект.Направление = Перечисления.НаправленияСообщенийМЭДО.Исходящее;
		ИначеЕсли ИнтеграцияСМЭДО.ЭтоВходящийДокумент(Объект.Документ) Тогда 
			Объект.Направление = Перечисления.НаправленияСообщенийМЭДО.Входящее;
		КонецЕсли;
		Реквизиты = ИнтеграцияСМЭДО.ПолучитьТребуемыеДанныеВходящегоДокумента(
			Объект.Документ, "Организация", МЭДОСтруктурыДанных.НовыйЛегкийОтвет());
		Объект.Организация = Реквизиты.Организация;
		
		Модифицированность = Истина;
	КонецЕсли;
	
	УправлениеДоступностьюВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписанДанныеДокументаМЭДО", Объект.Ссылка, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНаДиск(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Заголовок = НСтр("ru = 'Укажите каталог для сохранения файла'");
	Если Не Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;

	ИмяФайла = ?(ЗначениеЗаполнено(Объект.ИмяАрхиваЭСД), Объект.ИмяАрхиваЭСД, НСтр("ru = 'имя-файла-по-умолчанию.zip'"));
	
	Файл = Новый Файл(Диалог.Каталог);
	Если Не Файл.Существует() Тогда
		ПоказатьПредупреждение( , 
			СтрШаблон(НСтр("ru = 'Каталог %1 не существует или не доступен!'"), Диалог.Каталог));
		Возврат;
	КонецЕсли;
	
	ПолноеИмяФайла = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(Диалог.Каталог) + ИмяФайла;
	Файл = Новый Файл(ПолноеИмяФайла);
	ДопПараметры = Новый Структура("ПолноеИмяФайла", ПолноеИмяФайла);
	Если Файл.Существует() Тогда
		Оповещение = Новый ОписаниеОповещения("ЗаписатьФайлЭсдНаДиск", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(Оповещение , НСтр("ru = 'Файл существует, перезаписать?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаписатьФайлЭсдНаДиск(КодВозвратаДиалога.Да, ДопПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПоМЭДО(Команда)
	
	Если Объект.Ссылка.Пустая() Или Модифицированность Тогда 
		Если Не Записать() Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Не Объект.ГотовКОтправке Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Необходимо установить флаг ""Готов к отправке""'"),
			Объект.Ссылка,
			"ГотовКОтправке",
			"Объект");
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	ДанныеОтвета = МЭДОКлиент.НовыйЛегкийОтвет();
	МЭДОВызовСервера.ОтправитьИсходящиеДокументы(
		Объект.Организация,
		ДанныеОтвета,
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Документ));
	
	ТекстОтвета = НСтр("ru = 'Документ отправлен'");
	Если Не ДанныеОтвета.Успех Тогда
		ТекстОтвета = НСтр("ru = 'При отправке возникли ошибки'");
	КонецЕсли;
	ПоказатьПредупреждение(, ТекстОтвета);
	Прочитать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеДоступностьюВидимостью()
	
	ЭтоИсходящее = (Объект.Направление = Перечисления.НаправленияСообщенийМЭДО.Исходящее);
	Элементы.ОтправитьПоМЭДО.Видимость = ЭтоИсходящее;
	
КонецПроцедуры

// Записать файл ЭСД на диск.
// 
// Параметры:
//  РезультатВопроса - КодВозвратаДиалога
//  ДопПараметры - Структура 
&НаКлиенте
Процедура ЗаписатьФайлЭсдНаДиск(РезультатВопроса, ДопПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанные = ПрочитатьДвоичныеДанныеФайлаЭсд();
	Если ТипЗнч(ДвоичныеДанные) <> Тип("ДвоичныеДанные") Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'В данном контейнере не обнаружен файл.'"));
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанные.Записать(ДопПараметры.ПолноеИмяФайла);
	
КонецПроцедуры

// Прочитать двоичные данные файла.
// 
// Возвращаемое значение:
//  ДвоичныеДанные - Прочитать двоичные данные файла
&НаСервере
Функция ПрочитатьДвоичныеДанныеФайлаЭсд()
	
	Если Объект.Документ.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Данные = Документы.ДанныеДокументаМЭДО.ПолучитьДанныеДокументаМЭДО(
		Объект.Документ, "АрхивЭСД", МЭДОСтруктурыДанных.НовыйЛегкийОтвет());
	Если Данные.АрхивЭСД = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Данные.АрхивЭСД.Получить();
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервереРедакцииКонфигурации()
	
	Элементы.Организация.Заголовок = ИнтеграцияСМЭДО.Организация();
	
КонецПроцедуры

#КонецОбласти
